<template>
  <div class="text-primary">
    <p>
      目前使用 nuxt3 + Tailwindcss + vite 進行響應式網站開發，並使用 flowbite
      建造共用元件模板，提升開發速度。
    </p>
    <p>
      在程式協作面上，我熟悉 Git
      版本控制，能夠有效地協作開發；使用者體驗面上，我與設計團隊溝通協作，將
      figma 畫面變現實，並針對流程提出優化建議；串接 API
      面上，我與後端工程師、DevOps 緊密合作，確保網站可以正確運行。
    </p>
    <p>
      針對近期崛起的 AI 浪潮，我也正在嘗試使用
      Copilot、AmazonQ、ChatGPT、ClaudAI 等工具，提升寫網站的速度與品質。
    </p>
    <p>
      現階段我已可以在規劃時程內，完整交付網站。未來希望可以持續提升程式碼的品質與網站效能，並嘗試單元測試。
    </p>
    <p>
      目前我雖然是主要寫 vue
      框架的前端工程師，但未來有機會也不排斥接觸其他前端語言，也因為過去曾有短暫寫過
      PHP，未來亦不排斥向後端工程師等相關工作領域發展。
    </p>
  </div>
</template>
